# ColumnHeightZeroBecauseOfInvalidOffset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..ColumnHeightZeroBecauseOfInvalidOffset Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Change Offset Value so that Column height is not 0.0.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ColumnHeightZeroBecauseOfInvalidOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ColumnHeightZeroBecauseOfInvalidOffset As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ColumnHeightZeroBecauseOfInvalidOffset {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace